{
  "backend/main.mo": "Main Motoko actor implementing script repository backend with access control, user profiles, and CRUD operations for scripts; includes public read endpoints and authenticated write/delete operations with admin privileges for viewing all deleted scripts.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: homepage script listing, My Scripts page with edit/delete, and script detail page with syntax highlighting, mapped to test IDs REQ-1, REQ-2, and REQ-3.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files for the Rawly41 Store script repository application with PWA support and authentication.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a developer-focused dark theme with grayscale base colors and accent colors for charts and UI elements.",
  "frontend/index.html": "HTML entry point for Rawly41 Store with PWA meta tags including manifest link, Apple touch icon, and mobile web app configuration for home screen installation.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, standalone display mode, turquoise theme color (#40E0D0), and icon configurations for 192x192 and 512x512 sizes.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, script detail, and my-scripts pages, wrapped with ThemeProvider, ProfileSetupModal, OnboardingModal, and Toaster components.",
  "frontend/src/components/AuthGuard.tsx": "Empty file placeholder for route protection component (no implementation present).",
  "frontend/src/components/CodeBlock.tsx": "Code display component with syntax highlighting styling and copy-to-clipboard functionality using navigator.clipboard API with toast notifications.",
  "frontend/src/components/Layout.tsx": "Application layout with header containing Rawly41 logo, navigation links (My Scripts, Submit Script for authenticated users), LoginButton, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/OnboardingModal.tsx": "First-time visitor modal displaying \"Do This First\" message encouraging users to add the app to their home screen, dismissible via localStorage tracking through useOnboardingModal hook.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Prevents dismissal until profile is created.",
  "frontend/src/components/ScriptCard.tsx": "Card component displaying script metadata (title, description, category, author, creation date) with hover effects and link to script detail page.",
  "frontend/src/components/ScriptGrid.tsx": "Grid layout component that renders a collection of ScriptCard components with loading skeletons and empty state messaging.",
  "frontend/src/components/ScriptSearch.tsx": "Search and filter UI with debounced text input for title search, category dropdown selector, and clear button.",
  "frontend/src/components/ScriptSubmissionForm.tsx": "Form component for creating new scripts with fields for title, description, category selection, and code content with validation and toast notifications.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useOnboardingModal.ts": "Hook that manages onboarding modal visibility state using localStorage to track if user has seen the modal.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles and scripts, including queries for fetching/searching scripts and mutations for creating/updating/deleting scripts.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero banner, script search/filter functionality, and a grid of scripts with conditional rendering based on authentication status.",
  "frontend/src/pages/MyScriptsPage.tsx": "Authenticated user page for managing personal scripts with edit and delete functionality, including dialogs for editing script details and confirming deletions.",
  "frontend/src/pages/ScriptDetailPage.tsx": "Individual script detail view showing full script content with syntax highlighting, metadata, and delete option for script authors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH, typography, animations, and container settings.",
  "project_state.json": "Project metadata tracking known issues (missing scripts), existing features for script CRUD operations, and pending feature requests to restore script functionality."
}