{
  "backend/main.mo": "Main Motoko actor implementing a script marketplace with user profiles, script CRUD operations, search/filter functionality, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, and configuration files for the Rawly41 Store application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for the application's design tokens.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, Apple touch icon configuration, and mobile web app settings for home screen installation.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode, and theme colors for Rawly41 Store progressive web app installation.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, script detail, and my scripts pages, wrapped with ThemeProvider and ProfileSetupModal.",
  "frontend/src/components/AuthGuard.tsx": "Route protection component that redirects unauthenticated users to home page and displays loading spinner during authentication initialization.",
  "frontend/src/components/CodeBlock.tsx": "Code display component with syntax highlighting, copy-to-clipboard functionality, and hover-revealed copy button with success feedback.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing Rawly41 logo, navigation links for authenticated users, login button, and footer with attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog prompting authenticated users without profiles to enter their name, with form validation and loading state management.",
  "frontend/src/components/ScriptCard.tsx": "Reusable card component displaying script metadata (title, description, category, author, date) with hover effects and navigation to detail page.",
  "frontend/src/components/ScriptGrid.tsx": "Displays a responsive grid of script cards with loading skeletons and an empty state when no scripts are found.",
  "frontend/src/components/ScriptSearch.tsx": "Provides a search input with debouncing and category filter dropdown, with a clear button to reset filters.",
  "frontend/src/components/ScriptSubmissionForm.tsx": "Form component for submitting new scripts with fields for title, description, category, and content, using mutation hooks to create scripts.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating scripts and user profiles, including search, filter, create, update, and delete operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using HSL values.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Main page displaying a hero banner, script search/filter interface, submission form for authenticated users, and a grid of scripts based on search/filter criteria.",
  "frontend/src/pages/MyScriptsPage.tsx": "Displays and manages the authenticated user's submitted scripts with edit and delete functionality, including a dialog form for editing script details (title, description, category, content) and an alert dialog for deletion confirmation.",
  "frontend/src/pages/ScriptDetailPage.tsx": "Shows detailed view of a single script with syntax-highlighted code, metadata (author, dates, category), and delete functionality for script authors using an alert dialog confirmation.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color variables, custom theme extensions (fonts, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking implemented features including homepage script browsing, search/filtering, authentication with Internet Identity, dark theme styling, and rebranding to 'Rawly41 Store' with custom logo and PWA manifest requirements."
}