{
  "backend/main.mo": "Main Motoko actor implementing script repository backend with access control, user profiles, and CRUD operations for scripts including search, filtering, and authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including homepage layout, search/filtering, script detail view, authentication, and visual theming with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a developer-focused dark theme.",
  "frontend/index.html": "HTML entry point for the Script Vault Hub application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, script detail, and my scripts pages, wrapped in ThemeProvider with ProfileSetupModal and Toaster.",
  "frontend/src/components/AuthGuard.tsx": "Route protection component that redirects unauthenticated users to home page and displays loading spinner during authentication initialization.",
  "frontend/src/components/CodeBlock.tsx": "Code display component with syntax highlighting styling and copy-to-clipboard functionality using toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo, navigation, login button, and footer with attribution and copyright.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states, error handling for duplicate authentication, and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, using Internet Identity authentication and profile query hooks. Prevents closing until the profile is saved.",
  "frontend/src/components/ScriptCard.tsx": "Card component displaying a script's title, description, category badge, creation date, and author principal. Links to the script detail page with hover effects.",
  "frontend/src/components/ScriptGrid.tsx": "Grid layout component that displays script cards with loading skeletons and empty state. Shows a 3-column responsive grid of scripts or appropriate fallback UI.",
  "frontend/src/components/ScriptSearch.tsx": "Search and filter UI with debounced text input for script titles and category dropdown selector. Includes a clear button to reset all filters.",
  "frontend/src/components/ScriptSubmissionForm.tsx": "Form component for creating new scripts with fields for title, description, category selection, and code content. Handles validation and submission with toast notifications.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous actors. Invalidates dependent queries when the actor changes due to identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles and scripts, including queries for fetching, searching, and filtering scripts, plus mutations for creating, updating, and deleting scripts. All hooks depend on the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including accent color (teal/green), background, foreground, and semantic UI colors using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero banner, script browsing grid with search/filter capabilities, and authenticated script submission form. Manages state for search queries, category filters, and conditionally displays scripts based on user input.",
  "frontend/src/pages/MyScriptsPage.tsx": "Authenticated user page for managing personal scripts with edit and delete functionality. Includes dialogs for editing script details and confirming deletions, using forms with categories dropdown and text inputs.",
  "frontend/src/pages/ScriptDetailPage.tsx": "Individual script detail page showing full script information with syntax-highlighted code block, metadata (author, dates), and delete functionality for script authors. Includes navigation back to home and error handling for missing scripts.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both standard query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended theme with custom fonts (Inter, JetBrains Mono), animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking implemented features (homepage, search/filter, detail view, authentication, theming) and pending requirements for Script Vault Hub application based on reference website."
}